src/main/java/com/ithome/web/Constances/Constance.java

package com.ithome.web.Constances;

public class Constance {
    public static final String USERNAME = "noiroxc@gmail.com";
    public static final String PASSWORD = "mnbvcxz00A!";
    public static final String FROM = "noiroxc@gmail.com";
    public static final String HOST = "smtp.gmail.com";
    public static final String PORT = "465";
    public static final String PORT2 = "143";
    public static final String SOCKET_FACTORY = "mail.smtp.socketFactory.port";
    public static final String SMTP_PORT = "mail.smtp.port";

    //public static final String USERNAMEINDATA = "oferta_root";
    public static final String USERNAMEINDATA2 = "root";
    //public static final String USERPASSWORDINDATA = "^Z~&mmGmLft?";
    public static final String USERPASSWORDINDATA2 = "YLf{}cJ,Kvd%";
    //public static final String USERPASSWORDINDATA2 = "root";

    //public static final String USERPASSWORDINDATA = "root";

    public static final String BASE_URL = "http://api.cba.am/";
    public static final String XML_BODY = "<soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n" +
            "  <soap:Body>\n" +
            "    <ExchangeRatesLatest xmlns=\"http://www.cba.am/\" />\n" +
            "  </soap:Body>\n" +
            "</soap:Envelope>";


}
